2025新興科技教育遠距示範服務計畫.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-21 Mon 11:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2025新興科技教育遠距示範服務計畫</title>
<meta name="author" content="Yung-Chin Yen" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/muse.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">2025新興科技教育遠距示範服務計畫</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3aca0f6">1. 前言</a></li>
<li><a href="#org54ff660">2. 跨域素養</a>
<ul>
<li><a href="#orgf67786e">2.1. 資訊科技</a></li>
<li><a href="#org8507878">2.2. 數學科</a></li>
</ul>
</li>
<li><a href="#orgd0a30c2">3. 學習目標</a></li>
<li><a href="#org77a2a0e">4. 教學大綱</a>
<ul>
<li><a href="#orga25e3a4">4.1. 第1週: Introduction to AI</a></li>
<li><a href="#org83facfe">4.2. 第2週: Statistical Analysis and Regression Prediction</a></li>
<li><a href="#org467e244">4.3. 第3週: Data Preprocessing and Cleaning</a></li>
<li><a href="#orgb4a7349">4.4. 第4週: Introduction to Supervised Learning</a></li>
<li><a href="#org6cd4493">4.5. 第5週: Introduction to Supervised Learning</a></li>
<li><a href="#org21aeffa">4.6. 第6週: Introduction to Unsupervised Learning</a></li>
<li><a href="#org582df71">4.7. 第7週: Perceptron: The Foundation of Neural Networks</a></li>
<li><a href="#org6098ae0">4.8. 第8週: Introduction to Deep Learning</a></li>
<li><a href="#org69fa900">4.9. 第9週: Introduction to Deep Learning and CNN</a></li>
<li><a href="#orgced0e54">4.10. 第10週: Mathematics Special Topic: Mathematical Explanation of Gradient Descent</a></li>
<li><a href="#org61b9a5e">4.11. 第11週: You Only Look Once</a></li>
<li><a href="#org3c1343d">4.12. 第12週: LSTM與RNN簡介及實作</a></li>
<li><a href="#org503e4f8">4.13. 第13週: AI Prediction: Unveiling the Sacred Exam Outcome</a></li>
<li><a href="#org5e62754">4.14. 第14週: One Model Isn’t Enough? Let’s Use More!</a></li>
<li><a href="#org8d5bb76">4.15. 第15週: 期末專題準備</a></li>
<li><a href="#org4779267">4.16. 第16週: 期末專題實作</a></li>
<li><a href="#org88823fc">4.17. 第17週: 期末專題實作</a></li>
<li><a href="#orge4594b6">4.18. 第18週: 期末專題成果發表</a></li>
</ul>
</li>
<li><a href="#orgc71fa9c">5. 學習評量</a>
<ul>
<li><a href="#orged77384">5.1. 卜聖卦活動1：自我預測 (Self-Assessment Prediction)</a></li>
<li><a href="#org713ac6a">5.2. 卜聖卦活動2：數學迴歸分析預測 (Regression Prediction)</a></li>
<li><a href="#orgc2d9b73">5.3. 卜聖卦活動3：AI迴歸模型預測 (AI Regression Model Prediction)</a></li>
<li><a href="#org5534651">5.4. 卜聖卦活動4：KNN與決策樹模型的學測預測 (KNN and Decision Tree Prediction for Entrance Exam Scores)</a></li>
<li><a href="#orgce46efc">5.5. 卜聖卦活動5：LSTM/RNN模型的段考預測 (LSTM/RNN Model Prediction for Exams)</a></li>
<li><a href="#org859d1c2">5.6. 卜聖卦活動6：隨機森林模型的學測預測 (Random Forest Prediction for Entrance Exam Scores)</a></li>
<li><a href="#org8b20cc6">5.7. 期末專題實作與發表 (Final Project Implementation and Presentation)</a></li>
</ul>
</li>
<li><a href="#orgda4dfb8">6. 採購</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3aca0f6" class="outline-2">
<h2 id="org3aca0f6"><span class="section-number-2">1.</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
抽靈籤，卜聖卦，籤聖卦定，卜卦兼算命，囝仔來卜好搖飼，大人來卜大賺錢，少年來卜好代誌，老人來卜活百二。<br />
</p>
</div>
</div>
<div id="outline-container-org54ff660" class="outline-2">
<h2 id="org54ff660"><span class="section-number-2">2.</span> 跨域素養</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf67786e" class="outline-3">
<h3 id="orgf67786e"><span class="section-number-3">2.1.</span> 資訊科技</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>運 a-V-2 能使用多元的觀點評論資訊科技相關議題。<br /></li>
<li>運 a-V-3 能探索新興的資訊科技。<br /></li>
<li>運 c-V-1 能使用資訊科技增進團隊合作效率。<br /></li>
<li>運 p-V-1 能整合資訊科技進行有效的溝通表達。<br /></li>
<li>運 t-V-2 能使用程式設計實現運算思維的解題方法。<br /></li>
<li>運 t-V-3  能應用運算思維評估解題方法的優劣。<br /></li>
<li>※運 a-V-5 能主動探索資訊科技新知。<br /></li>
<li>※設 c-V-3 能具備溝通協調、組織工作團隊的能力。<br /></li>
<li>※設 k-V-2 能了解科技產業現況及新興科技發展趨勢。<br /></li>
<li>※運 r-V-3能利用程式語言表達運算程序<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org8507878" class="outline-3">
<h3 id="org8507878"><span class="section-number-3">2.2.</span> 數學科</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>f-V-7: 理解導函數的意義，熟練其操作，並能用以解決問題。<br /></li>
<li>f-V-8: 認識微分與積分互為逆運算，理解微積分基本定理的意義，並能用以推論。<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgd0a30c2" class="outline-2">
<h2 id="orgd0a30c2"><span class="section-number-2">3.</span> 學習目標</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>資料預處理與統計分析技能：學生能理解並應用資料清理、正規化及基本統計分析方法，為後續AI模型訓練做好準備。<br /></li>
<li>AI模型的運作原理：學生理解分類與迴歸模型的原理，並能將這些技術應用於預測段考成績與學測級分。<br /></li>
<li>實作AI模型：學生能實作包括KNN、決策樹、感知器、神經網絡、YOLO、LSTM、RNN等多種AI模型，並應用這些模型進行實際預測。<br /></li>
<li>優化與評估模型：學生學會如何通過超參數調整來優化模型效能，並能評估不同模型的預測準確度，找出最佳解法。<br /></li>
<li>跨學科知識整合：學生能結合數學知識（如梯度下降法）與AI技術，深入理解AI模型的數學基礎。<br /></li>
<li>專題實作與發表：學生在期末專題中應用所學知識進行實作，並能展示專題成果，提升協作與表達能力。<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org77a2a0e" class="outline-2">
<h2 id="org77a2a0e"><span class="section-number-2">4.</span> 教學大綱</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orga25e3a4" class="outline-3">
<h3 id="orga25e3a4"><span class="section-number-3">4.1.</span> 第1週: Introduction to AI</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>本學期課程內容規畫簡介<br /></li>
<li>了解AI的運作原理與建構流程、認識不同AI類型以及其應用領域。<br /></li>
<li>介紹AI模型的基本概念，講解分類與迴歸的差異(段考成績預測為迴歸、學測級分預測為分類)，並簡介分類技術。<br /></li>
<li>理解資料正確性對於預測的重要性，進而了解資料預處理的必要性。<br /></li>
<li><span style="color:orange;">卜聖卦活動1</span>: 讓學生自行預測自己本學期(2下)第一次段考的各科成績，並讓學生列出自己做出預測的依據<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org83facfe" class="outline-3">
<h3 id="org83facfe"><span class="section-number-3">4.2.</span> 第2週: Statistical Analysis and Regression Prediction</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>[<span style="color:green;">內聘講師/數學科</span>]介紹基本統計分析方法，並進行數據的初步分析，然後引入數學迴歸分析，讓學生進行第一次段考的數據預測。<br /></li>
<li><span style="color:orange;">卜聖卦活動2</span>: 學生根據歷屆段考成績進行數學迴歸分析計算，以自己的一年級與二上成績預測二下第一次段考的成績，並與 <b><b><span style="color:orange;">卜聖卦活動1</span>的結果</b></b> 比較，討論預測依據的差異。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org467e244" class="outline-3">
<h3 id="org467e244"><span class="section-number-3">4.3.</span> 第3週: Data Preprocessing and Cleaning</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>介紹資料清理與預處理的基本概念，包括處理缺失值、數據標準化、正規化，並收集歷屆段考成績作為參考資料。<br /></li>
<li>學生收集學校提供的歷屆段考成績數據，並進行資料預處理實作，為後續模型建立做準備。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgb4a7349" class="outline-3">
<h3 id="orgb4a7349"><span class="section-number-3">4.4.</span> 第4週: Introduction to Supervised Learning</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>介紹AI實作迴歸的模型及運作原理<br /></li>
<li><span style="color:orange;">卜聖卦活動3</span>: 以AI迴歸模型來預測二下第一次段考成績，並與前兩次的預測結果比較，討論預測依據的差異。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org6cd4493" class="outline-3">
<h3 id="org6cd4493"><span class="section-number-3">4.5.</span> 第5週: Introduction to Supervised Learning</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>介紹AI實作分類的模型及運作原理<br /></li>
<li>介紹K最近鄰（KNN）分類模型的原理，並讓學生實作KNN模型來預測學測成績級分(依據一年級全學年及二上的成績)。<br /></li>
<li>介紹決策樹模型的原理及其應用，學生學習如何利用決策樹進行學測成績級分預測。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org21aeffa" class="outline-3">
<h3 id="org21aeffa"><span class="section-number-3">4.6.</span> 第6週: Introduction to Unsupervised Learning</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li><span style="color:orange;">卜聖卦活動4</span>: 依據學生二下第一次段考實際成績評估前三次(<span style="color:orange;">卜聖卦活動1</span>, <span style="color:orange;">卜聖卦活動2</span>, <span style="color:orange;">卜聖卦活動3</span>)預測的準確性<br /></li>
<li>了解非監督式學習的概念與運作原理。<br /></li>
<li>能實做簡單的非監督式學習模型。<br /></li>
<li>以K-Means技術實作影像壓縮<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org582df71" class="outline-3">
<h3 id="org582df71"><span class="section-number-3">4.7.</span> 第7週: Perceptron: The Foundation of Neural Networks</h3>
<div class="outline-text-3" id="text-4-7">
<ul class="org-ul">
<li>介紹神經網絡的基本概念與運作原理，了解如何將其應用到各項領域。<br /></li>
<li>能實作神經網路中的感知器。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org6098ae0" class="outline-3">
<h3 id="org6098ae0"><span class="section-number-3">4.8.</span> 第8週: Introduction to Deep Learning</h3>
<div class="outline-text-3" id="text-4-8">
<ul class="org-ul">
<li>能理解神經網路與深度學習的關係<br /></li>
<li>活動：神經網絡實作競賽: 學生實作神經網絡模型，並比賽誰的模型能最準確地預測下一次段考的成績。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org69fa900" class="outline-3">
<h3 id="org69fa900"><span class="section-number-3">4.9.</span> 第9週: Introduction to Deep Learning and CNN</h3>
<div class="outline-text-3" id="text-4-9">
<ul class="org-ul">
<li>介紹卷積神經網絡（CNN）的概念，並了解其在圖像分類中的應用，為學生理解模型架構打下基礎。<br /></li>
<li>了解CNN的運作原理。<br /></li>
<li>展示CNN在不同領域的應用，學生討論CNN是否適合段考分數與學測預測。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgced0e54" class="outline-3">
<h3 id="orgced0e54"><span class="section-number-3">4.10.</span> 第10週: Mathematics Special Topic: Mathematical Explanation of Gradient Descent</h3>
<div class="outline-text-3" id="text-4-10">
<ul class="org-ul">
<li>[<span style="color:green;">內聘講師/數學科</span>] 介紹梯度下降法的數學基礎，講解微分與導數的概念，並以數學公式解釋梯度下降法的原理。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org61b9a5e" class="outline-3">
<h3 id="org61b9a5e"><span class="section-number-3">4.11.</span> 第11週: You Only Look Once</h3>
<div class="outline-text-3" id="text-4-11">
<ul class="org-ul">
<li>介紹YOLO (You Only Look Once) 演算法的基本概念及其在即時物體偵測中的應用。<br /></li>
<li>舉例說明YOLO在即時影像、監控系統、交通管理等領域的實際應用。<br /></li>
<li>學生實作YOLO模型進行即時物體偵測。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org3c1343d" class="outline-3">
<h3 id="org3c1343d"><span class="section-number-3">4.12.</span> 第12週: LSTM與RNN簡介及實作</h3>
<div class="outline-text-3" id="text-4-12">
<ul class="org-ul">
<li>介紹長短期記憶（LSTM）和遞歸神經網絡（RNN）的原理，理解其在時間序列數據中的應用<br /></li>
<li>學生實作LSTM/RNN模型來預測學測成績。<br /></li>
<li><span style="color:orange;">卜聖卦活動5</span>: 依據學生一年級全學年、二上以及二下第一次段考成績，以LSTM/RNN預測二下第二次段考成績<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org503e4f8" class="outline-3">
<h3 id="org503e4f8"><span class="section-number-3">4.13.</span> 第13週: AI Prediction: Unveiling the Sacred Exam Outcome</h3>
<div class="outline-text-3" id="text-4-13">
<ul class="org-ul">
<li>學生進行模型的參數調整與優化，學習如何提升分類模型的預測精度。<br /></li>
<li>參數調整競賽: 學生嘗試調整模型參數，提升模型預測效果，並比較各組模型的預測效果。<br /></li>
<li><span style="color:orange;">卜聖卦活動6</span>: 學生分組(跨校異質分組)，以學校提供之歷屆學生段考與學測成績做為訓練資料，建立各組的預測模型。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org5e62754" class="outline-3">
<h3 id="org5e62754"><span class="section-number-3">4.14.</span> 第14週: One Model Isn’t Enough? Let’s Use More!</h3>
<div class="outline-text-3" id="text-4-14">
<ul class="org-ul">
<li><span style="color:orange;">卜聖卦活動6</span>結果實測: 教師以額外的測試資料對各組模型進行效能測試，請模型效能表現優異各組發表模型設計原理。<br /></li>
<li>介紹隨機森林模型的概念，並進行隨機森林的實作與模型優化。<br /></li>
<li>卜聖卦最終回: 各組以隨機森林實作出最後版本的學測級分預測模型<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org8d5bb76" class="outline-3">
<h3 id="org8d5bb76"><span class="section-number-3">4.15.</span> 第15週: 期末專題準備</h3>
<div class="outline-text-3" id="text-4-15">
<ul class="org-ul">
<li>卜聖卦最終回結果揭曉: 教師以額外的測試資料對各組最終模型進行效能測試。<br /></li>
<li>學生分組進行期末專題的準備，探討專題主題與所需資料與應用模型。<br /></li>
</ul>
</div>
</div>
