2025新興科技教育遠距示範服務計畫.html
<div id="outline-container-org4779267" class="outline-3">
<h3 id="org4779267"><span class="section-number-3">4.16.</span> 第16週: 期末專題實作</h3>
<div class="outline-text-3" id="text-4-16">
<ul class="org-ul">
<li>學生進行期末專題實作，完成分類模型的構建，並準備專題報告。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org88823fc" class="outline-3">
<h3 id="org88823fc"><span class="section-number-3">4.17.</span> 第17週: 期末專題實作</h3>
<div class="outline-text-3" id="text-4-17">
<ul class="org-ul">
<li>學生進行期末專題實作，完成分類模型的構建，並準備專題報告。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orge4594b6" class="outline-3">
<h3 id="orge4594b6"><span class="section-number-3">4.18.</span> 第18週: 期末專題成果發表</h3>
<div class="outline-text-3" id="text-4-18">
<ul class="org-ul">
<li>學生展示專題成果，各組發表專題實作的成果及學習心得，發表過程進行線上直播，邀請學生家長及校內同學上線觀看。<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc71fa9c" class="outline-2">
<h2 id="orgc71fa9c"><span class="section-number-2">5.</span> 學習評量</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orged77384" class="outline-3">
<h3 id="orged77384"><span class="section-number-3">5.1.</span> <span style="color:orange;">卜聖卦活動1</span>：自我預測 (Self-Assessment Prediction)</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>預測依據的合理性 (50%)：學生是否能清楚列出自己預測段考成績時的依據（如過去成績、學習習慣、學習時間等），並給出合理的解釋。<br /></li>
<li>預測準確度 (50%)：比較學生預測成績與實際段考成績，根據預測準確度進行評分。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org713ac6a" class="outline-3">
<h3 id="org713ac6a"><span class="section-number-3">5.2.</span> <span style="color:orange;">卜聖卦活動2</span>：數學迴歸分析預測 (Regression Prediction)</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>數據處理能力 (30%)：學生是否正確進行數據的清理與預處理，並運用適當的迴歸方法進行預測。<br /></li>
<li>模型選擇與解釋 (30%)：學生是否能清楚解釋為什麼選擇某種迴歸模型，並合理說明預測過程中的假設與限制。<br /></li>
<li>預測準確度 (40%)：根據迴歸分析結果與實際段考成績的對比，計算預測的準確性。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgc2d9b73" class="outline-3">
<h3 id="orgc2d9b73"><span class="section-number-3">5.3.</span> <span style="color:orange;">卜聖卦活動3</span>：AI迴歸模型預測 (AI Regression Model Prediction)</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>模型實作能力 (30%)：學生是否能成功實作迴歸模型，並正確應用數據進行訓練和預測。<br /></li>
<li>模型調參與優化 (30%)：學生是否對模型參數進行合理調整，並嘗試優化預測效果。<br /></li>
<li>預測準確度 (40%)：比較AI模型的預測結果與實際成績，計算模型的準確度，並分析準確度的高低。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org5534651" class="outline-3">
<h3 id="org5534651"><span class="section-number-3">5.4.</span> <span style="color:orange;">卜聖卦活動4</span>：KNN與決策樹模型的學測預測 (KNN and Decision Tree Prediction for Entrance Exam Scores)</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>模型實作能力 (30%)：學生是否能成功實作KNN與決策樹模型，並正確應用模型進行學測成績級分的預測。<br /></li>
<li>模型比較與選擇 (30%)：學生是否能對比KNN與決策樹模型的優缺點，並能合理選擇哪個模型更適合特定數據集。<br /></li>
<li>預測準確度 (40%)：根據預測結果與實際歷屆學測成績的對比，計算預測的準確度。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgce46efc" class="outline-3">
<h3 id="orgce46efc"><span class="section-number-3">5.5.</span> <span style="color:orange;">卜聖卦活動5</span>：LSTM/RNN模型的段考預測 (LSTM/RNN Model Prediction for Exams)</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li>模型實作與應用 (30%)：學生能否成功實作LSTM/RNN模型，並正確使用時間序列數據進行預測。<br /></li>
<li>數據處理與預測 (30%)：學生能否正確處理時間序列數據，並進行準確的預測。<br /></li>
<li>預測準確度 (40%)：LSTM/RNN模型的預測結果與實際段考成績的比較，並計算準確性。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org859d1c2" class="outline-3">
<h3 id="org859d1c2"><span class="section-number-3">5.6.</span> <span style="color:orange;">卜聖卦活動6</span>：隨機森林模型的學測預測 (Random Forest Prediction for Entrance Exam Scores)</h3>
<div class="outline-text-3" id="text-5-6">
<ul class="org-ul">
<li>模型實作與應用 (30%)：學生是否能成功實作隨機森林模型，並正確應用來預測學測成績級分。<br /></li>
<li>模型優化與調參 (30%)：學生是否能有效地進行參數調整與模型優化，提升預測的準確度。<br /></li>
<li>預測準確度 (40%)：根據隨機森林模型的預測結果與實際成績進行比較，評估預測準確性。<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org8b20cc6" class="outline-3">
<h3 id="org8b20cc6"><span class="section-number-3">5.7.</span> 期末專題實作與發表 (Final Project Implementation and Presentation)</h3>
<div class="outline-text-3" id="text-5-7">
<ul class="org-ul">
<li>專題模型構建與應用 (40%)：學生能否成功完成專題模型的構建，並應用所學技術進行有效的預測。專題應涵蓋數據預處理、模型實作、參數調整和結果分析等部分。<br /></li>
<li>專題創新性 (30%)：專題中有無創新性的應用，學生是否嘗試探索新技術或新的應用場景，並結合不同技術（如YOLO、LSTM等）進行預測。<br /></li>
<li>專題報告與成果展示 (30%)：學生的專題報告是否結構清晰、表達充分，並在成果展示中能有效解釋專題內容與核心技術。<br /></li>
</ul>
</div>
</div>
</div>
