2025新興科技教育遠距示範服務計畫.org
* 採購
|------------------------------------------------------------------------------+--------+------+--------|
| 產品                                                                         |   單價 | 數量 |   總價 |
|------------------------------------------------------------------------------+--------+------+--------|
| [[https://remarkable.com/store/overview/remarkable-paper-pro][reMarkable Paper Pro]]                                                         |  34000 |    1 |  34000 |
| [[https://www.yingxiang.com.tw/product/nvidia-quadro-rtx5000-16gb/][NVIDIA Quadro RTX 5000 16GB GPU繪圖卡]]                                        |  73000 |    1 |  73000 |
| [[https://www.pcstore.com.tw/cheerchain/M43434601.htm][TechSmith Camtasia 2024 教育單機下載版]]                                       |   9990 |    1 |   9990 |
| [[https://pdf.wondershare.tw/pdf-editor-mac/free-pdf-editing-software-mac.html][PDFelement(PDF編輯器/年費))]]                                                  |   2600 |    2 |   5200 |
| [[https://www.books.com.tw/products/N001036755?loc=P_0009_005][A5筆記本]]                                                                     |    160 |   10 |   1600 |
| [[https://www.books.com.tw/products/N001038981?loc=P_0009_031][A4筆記本]]                                                                     |    260 |   10 |   2600 |
| [[https://www.momoshop.com.tw/goods/GoodsDetail.jsp?i_code=10490529&str_category_code=4201300088&ctype=B&Area=DgrpCategory&sourcePageType=4][6開5插USB+Type C PD 30W 快充延長線 ]]                                          |   1290 |   20 |  25800 |
| [[https://24h.pchome.com.tw/prod/DYAPH4-A900GY943?fq=/S/DYAPH4][AponeType-C to Type-C USB4 PD240W 充電傳輸線 1.5M]]                            |    790 |    5 |   3950 |
| [[https://www.apple.com/tw/shop/product/MLYV3FE/A/usb-c-%E5%B0%8D-magsafe-3-%E9%80%A3%E6%8E%A5%E7%B7%9A-2-%E5%85%AC%E5%B0%BA-%E9%8A%80%E8%89%B2?fnode=e7f8880b9bf3ebb501e2b2e6aebefebbda241e527575cf816849435c5f4fc55aff3416ea51f266a05e0f5869d9680186274749c411dbc94685b201d7be4a33e5482d0391fa99406e87638e441a6664fe37bfa3546a0c429572d73e06f9a4cc7e][USB-C 對 MagSafe 3 連接線 (2 公尺) - 銀色]]                                    |   1490 |    1 |   1490 |
| [[https://24h.pchome.com.tw/prod/DYAP4B-A900HGLAW?fq=/S/DYAP4B][USB-C to Lightning傳輸線]]                                                     |    700 |    5 |   3500 |
| [[https://chatgpt.com/#pricing][ChatGPT Plus 24月]]                                                            |    650 |   24 |  15600 |
| [[https://24h.pchome.com.tw/region/DCAB?srsltid=AfmBOootGSjNOjT4SfPTeGJidTJImzL6GmGKS44cdl0kHxMwDrBl52eK][Panasonic eneloop pro充電電池]]                                                |   3600 |    1 |   3600 |
| [[https://24h.pchome.com.tw/prod/QBAA27-A9009APZK?fq=/S/DYBE56][Panasonic充電器]]                                                              |   1690 |    1 |   1690 |
| [[https://m.momoshop.com.tw/goods.momo?i_code=8346321][Logitech 羅技 Ergo M575無線藍牙軌跡球]]                                        |   1490 |   10 |  14900 |
| [[https://www.ambertech.com.tw/ecommerce/mub-c12.html][MUB-C12_ USB A to micro USB (micro B)極強韌QC 3.0快速充電線]]                  |    420 |    3 |   1260 |
| [[https://24h.pchome.com.tw/prod/DCAYBL-A900ALIZV?fq=/S/DYAPAI][USB-C 對 3.5mm 耳機插孔轉接器]]                                                |    590 |    3 |   1770 |
| [[https://soundpathaudio.com/product/rode-nt-usb-%E9%9B%BB%E5%AE%B9%E5%BC%8F%E9%BA%A5%E5%85%8B%E9%A2%A8/][RODE NT-USB+ 電容式麥克風]]                                                    |   7000 |    1 |   7000 |
| [[https://www.patron-dry.com.tw/142~490%E5%85%AC%E5%8D%87%E4%B8%AD%E5%9E%8B%E9%98%B2%E6%BD%AE%E7%AE%B1/09000731.html][AH-216 中型防潮箱 W400.D510.H1395mm]]                                          |  17800 |    1 |  17800 |
| [[https://24h.pchome.com.tw/prod/DRAB6A-A900HRHNA?fq=/S/DRAB77][TOSHIBA 東芝【N300 NAS碟】(HDWG51CAZSTA) 12TB /7200轉/512MB/3.5吋/3Y NAS硬碟]] |  10390 |    1 |  10390 |
| [[https://www.da-xin.com.tw/product-detail-3601966.html][開閉式磁性烤漆玻璃白板-雙層]] (大致詢價結果)                                   |  40000 |    1 |  40000 |
| 電腦椅(我找不到教室那種椅子的網頁,單價也忘了!!，應該是沒超過1000...)         |    900 |   35 |  31500 |
| 廣播系統(詢價中)                                                             | 100000 |    1 | 100000 |
| 電腦書(可以的話先些錢，書要慢慢找，最好是經費下來後再買當年度的新書)         |  10000 |    1 |  10000 |
|------------------------------------------------------------------------------+--------+------+--------|
| 總價                                                                         |  19589 |      | 416640 |
|------------------------------------------------------------------------------+--------+------+--------|
#+TBLFM: $4=$3*$2::@>$4=vsum(@2$4..@-1$4

* tmp :noexport:
- 介紹課程內容及目標:
- 活動：自我成績預測學生根據自身學習狀況，預測第一次段考的各科成績，並記錄預測依據（如過去成績、學習習慣、時間投入等）。小組內分享討論每個人預測的依據，學生可互相觀察彼此的預測思路。

1. Way to Become Rich
   - 投資目標挑選依據
   - 六年投資報酬率
2. Can AI Make Everyone Rich?
   - CNN模型圖片辨識準確率
   - 股票預測模型準確率
根據你重新設計的課程架構，我將為每個活動設計出具體的評量標準，讓學習評量體系更有系統且能夠涵蓋學生在每一階段的成長與應用能力。以下是根據每週課程主題設計的評量標準：

### 1. 卜聖卦活動1：自我預測
     - 預測依據的完整性與合理性 (40%):學生是否清楚列出自己在預測段考成績時的依據（如過去成績、學習習慣、學習時間等）。
     - 預測結果的準確性 (60%):比較學生自我預測與實際段考成績，根據預測準確度進行評分。
### 2. 卜聖卦活動2：數學迴歸分析預測
     - 資料分析能力 (40%):學生能否正確運用統計分析方法及迴歸技術，進行資料預測。
     - 預測準確性 (40%):迴歸分析結果與實際段考成績的差異。
     - 預測依據的比較與反思 (20%):學生能否將自我預測與迴歸模型的預測進行比較，並合理解釋差異。
### 3. 卜聖卦活動3：AI迴歸模型預測
     - AI模型實作能力 (40%):學生能否正確實作迴歸模型，並進行數據處理及預測。
     - 模型預測準確性 (40%):比較AI模型預測結果與實際段考成績，計算模型準確度。
     - 模型參數調整與優化 (20%):學生是否對模型參數進行合理調整，並解釋其優化策略。
### 4. 卜聖卦活動4：KNN與決策樹模型的學測級分預測
   - 評量標準:
     - 模型實作能力 (30%):學生能否成功實作KNN與決策樹模型，並應用於學測成績級分的預測。
     - 模型預測準確性 (40%):比較預測結果與實際歷屆學測成績的差異，計算準確度。
     - 模型選擇與解釋 (30%):學生能否合理解釋為何選擇KNN或決策樹進行預測，並比較兩者的效果。
### 5. 卜聖卦活動5：LSTM/RNN模型的段考預測
   - 評量標準:
     - 模型實作與應用 (40%):學生能否正確實作LSTM或RNN模型，並應用於時間序列預測。
     - 預測準確度 (40%):比較LSTM/RNN模型的預測結果與實際段考成績，評估模型效果。
     - 數據處理與時間序列應用 (20%):學生能否正確處理時間序列數據，並合理應用於模型中。
### 6. 參數調整競賽
   - 評量標準:
     - 參數調整策略 (40%):學生能否提出有效的參數調整策略，並解釋其對模型預測效果的影響。
     - 模型準確度提升 (40%):調整後的模型在預測精度上的提升幅度。
     - 模型調整後的穩定性 (20%):調整後模型是否在不同測試資料下保持穩定的預測結果。
### 7. 卜聖卦最終回：隨機森林模型的學測預測
   - 評量標準:
     - 隨機森林模型實作能力 (40%):學生能否正確實作隨機森林模型，並應用於學測成績級分預測。
     - 模型預測準確性 (40%):隨機森林模型的預測準確度，並與其他模型進行比較。
     - 模型優化與解釋 (20%):學生能否進行隨機森林的參數調整，並合理解釋調整策略。
### 8. 期末專題實作與展示
   - 評量標準:
     - 專題模型構建與應用 (40%):學生是否成功完成期末專題的AI模型構建，並應用於預測問題。
     - 創新性與實用性 (30%)**：學生在專題中的創新性應用，以及專題的實際應用效果。
     - 報告展示與團隊協作 (30%)**：學生專題報告是否條理清晰，並能有效展示專題成果，團隊合作表現如何。

---

這些評量標準針對每一週的活動和專題進行設計，不僅考慮了模型的實作與預測準確性，還重視學生在資料處理、參數調整和模型優化中的應用能力。
