2025新興科技教育遠距示範服務計畫.html
<div id="outline-container-orgda4dfb8" class="outline-2">
<h2 id="orgda4dfb8"><span class="section-number-2">6.</span> 採購</h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">產品</th>
<th scope="col" class="org-right">單價</th>
<th scope="col" class="org-right">數量</th>
<th scope="col" class="org-right">總價</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://remarkable.com/store/overview/remarkable-paper-pro">reMarkable Paper Pro</a></td>
<td class="org-right">34000</td>
<td class="org-right">1</td>
<td class="org-right">34000</td>
</tr>

<tr>
<td class="org-left"><a href="https://www.yingxiang.com.tw/product/nvidia-quadro-rtx5000-16gb/">NVIDIA Quadro RTX 5000 16GB GPU繪圖卡</a></td>
<td class="org-right">73000</td>
<td class="org-right">1</td>
<td class="org-right">73000</td>
</tr>

<tr>
<td class="org-left"><a href="https://www.pcstore.com.tw/cheerchain/M43434601.htm">TechSmith Camtasia 2024 教育單機下載版</a></td>
<td class="org-right">9990</td>
<td class="org-right">1</td>
<td class="org-right">9990</td>
</tr>

<tr>
<td class="org-left"><a href="https://pdf.wondershare.tw/pdf-editor-mac/free-pdf-editing-software-mac.html">PDFelement(PDF編輯器/年費))</a></td>
<td class="org-right">2600</td>
<td class="org-right">2</td>
<td class="org-right">5200</td>
</tr>

<tr>
<td class="org-left"><a href="https://www.books.com.tw/products/N001036755?loc=P_0009_005">A5筆記本</a></td>
<td class="org-right">160</td>
<td class="org-right">10</td>
<td class="org-right">1600</td>
</tr>

<tr>
<td class="org-left"><a href="https://www.books.com.tw/products/N001038981?loc=P_0009_031">A4筆記本</a></td>
<td class="org-right">260</td>
<td class="org-right">10</td>
<td class="org-right">2600</td>
</tr>

<tr>
<td class="org-left"><a href="https://www.momoshop.com.tw/goods/GoodsDetail.jsp?i_code=10490529&amp;str_category_code=4201300088&amp;ctype=B&amp;Area=DgrpCategory&amp;sourcePageType=4">6開5插USB+Type C PD 30W 快充延長線 </a></td>
<td class="org-right">1290</td>
<td class="org-right">20</td>
<td class="org-right">25800</td>
</tr>

<tr>
<td class="org-left"><a href="https://24h.pchome.com.tw/prod/DYAPH4-A900GY943?fq=/S/DYAPH4">AponeType-C to Type-C USB4 PD240W 充電傳輸線 1.5M</a></td>
<td class="org-right">790</td>
<td class="org-right">5</td>
<td class="org-right">3950</td>
</tr>

<tr>
<td class="org-left"><a href="https://www.apple.com/tw/shop/product/MLYV3FE/A/usb-c-%E5%B0%8D-magsafe-3-%E9%80%A3%E6%8E%A5%E7%B7%9A-2-%E5%85%AC%E5%B0%BA-%E9%8A%80%E8%89%B2?fnode=e7f8880b9bf3ebb501e2b2e6aebefebbda241e527575cf816849435c5f4fc55aff3416ea51f266a05e0f5869d9680186274749c411dbc94685b201d7be4a33e5482d0391fa99406e87638e441a6664fe37bfa3546a0c429572d73e06f9a4cc7e">USB-C 對 MagSafe 3 連接線 (2 公尺) - 銀色</a></td>
<td class="org-right">1490</td>
<td class="org-right">1</td>
<td class="org-right">1490</td>
</tr>

<tr>
<td class="org-left"><a href="https://24h.pchome.com.tw/prod/DYAP4B-A900HGLAW?fq=/S/DYAP4B">USB-C to Lightning傳輸線</a></td>
<td class="org-right">700</td>
<td class="org-right">5</td>
<td class="org-right">3500</td>
</tr>

<tr>
<td class="org-left"><a href="https://chatgpt.com/#pricing">ChatGPT Plus 24月</a></td>
<td class="org-right">650</td>
<td class="org-right">24</td>
<td class="org-right">15600</td>
</tr>

<tr>
<td class="org-left"><a href="https://24h.pchome.com.tw/region/DCAB?srsltid=AfmBOootGSjNOjT4SfPTeGJidTJImzL6GmGKS44cdl0kHxMwDrBl52eK">Panasonic eneloop pro充電電池</a></td>
<td class="org-right">3600</td>
<td class="org-right">1</td>
<td class="org-right">3600</td>
</tr>

<tr>
<td class="org-left"><a href="https://24h.pchome.com.tw/prod/QBAA27-A9009APZK?fq=/S/DYBE56">Panasonic充電器</a></td>
<td class="org-right">1690</td>
<td class="org-right">1</td>
<td class="org-right">1690</td>
</tr>

<tr>
<td class="org-left"><a href="https://m.momoshop.com.tw/goods.momo?i_code=8346321">Logitech 羅技 Ergo M575無線藍牙軌跡球</a></td>
<td class="org-right">1490</td>
<td class="org-right">10</td>
<td class="org-right">14900</td>
</tr>

<tr>
<td class="org-left"><a href="https://www.ambertech.com.tw/ecommerce/mub-c12.html">MUB-C12_ USB A to micro USB (micro B)極強韌QC 3.0快速充電線</a></td>
<td class="org-right">420</td>
<td class="org-right">3</td>
<td class="org-right">1260</td>
</tr>

<tr>
<td class="org-left"><a href="https://24h.pchome.com.tw/prod/DCAYBL-A900ALIZV?fq=/S/DYAPAI">USB-C 對 3.5mm 耳機插孔轉接器</a></td>
<td class="org-right">590</td>
<td class="org-right">3</td>
<td class="org-right">1770</td>
</tr>

<tr>
<td class="org-left"><a href="https://soundpathaudio.com/product/rode-nt-usb-%E9%9B%BB%E5%AE%B9%E5%BC%8F%E9%BA%A5%E5%85%8B%E9%A2%A8/">RODE NT-USB+ 電容式麥克風</a></td>
<td class="org-right">7000</td>
<td class="org-right">1</td>
<td class="org-right">7000</td>
</tr>

<tr>
<td class="org-left"><a href="https://www.patron-dry.com.tw/142~490%E5%85%AC%E5%8D%87%E4%B8%AD%E5%9E%8B%E9%98%B2%E6%BD%AE%E7%AE%B1/09000731.html">AH-216 中型防潮箱 W400.D510.H1395mm</a></td>
<td class="org-right">17800</td>
<td class="org-right">1</td>
<td class="org-right">17800</td>
</tr>

<tr>
<td class="org-left"><a href="https://24h.pchome.com.tw/prod/DRAB6A-A900HRHNA?fq=/S/DRAB77">TOSHIBA 東芝【N300 NAS碟】(HDWG51CAZSTA) 12TB /7200轉/512MB/3.5吋/3Y NAS硬碟</a></td>
<td class="org-right">10390</td>
<td class="org-right">1</td>
<td class="org-right">10390</td>
</tr>

<tr>
<td class="org-left"><a href="https://www.da-xin.com.tw/product-detail-3601966.html">開閉式磁性烤漆玻璃白板-雙層</a> (大致詢價結果)</td>
<td class="org-right">40000</td>
<td class="org-right">1</td>
<td class="org-right">40000</td>
</tr>

<tr>
<td class="org-left">電腦椅(我找不到教室那種椅子的網頁,單價也忘了!!，應該是沒超過1000&#x2026;)</td>
<td class="org-right">900</td>
<td class="org-right">35</td>
<td class="org-right">31500</td>
</tr>

<tr>
<td class="org-left">廣播系統(詢價中)</td>
<td class="org-right">100000</td>
<td class="org-right">1</td>
<td class="org-right">100000</td>
</tr>

<tr>
<td class="org-left">電腦書(可以的話先些錢，書要慢慢找，最好是經費下來後再買當年度的新書)</td>
<td class="org-right">10000</td>
<td class="org-right">1</td>
<td class="org-right">10000</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">總價</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">416640</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yung-Chin Yen</p>
<p class="date">Created: 2024-10-21 Mon 11:52</p>
</div>
</body>
</html>
